package cn.fivejoy.dsa.now;

/**
 * @description:
 * @author: liululu
 * @create: 2019/10/27 18:07
 */
public class Content {
    /**
     * 看PPT和笔记写代码
     */

    /**
     *第三章
     * 10 打印两个有序链表的公共部分
     * 11 判断一个链表是否是回文结构 15->6->15，返回true  1->2->3，返回false。
     * 12 将单向链表按某值划分成左边小、中间相等、右边大的形式
     * 14 两个单链表相交的一系列问题
     * 15 反转单向和双向链表
     *
     */
    /**
     * 第四章
     *  5 二叉树先序、中序，后序遍历的非递归实现---视频5.1 1:37min不要看视频了，视频讲的一般。后序遍历https://blog.csdn.net/zhuqiuhui/article/details/51319165
     *   待整理笔记
     *  6 levelOrder 二叉树
     *
     *  6 折纸问题 视频5.1 02:05 纸条对折N次，从上到下依次打印纸条折痕方向，凹/凸
     *  7 在二叉树中找出一个节点的后继节点 5.1 「02：28
     *  8 并查集
     *  9 数组中找局部最小
     *
     */

    /**
     * 第五章--视频⑥1:00处
     * 1.前缀树
     *
     */
}
